※ 정리
- 변수명.transpose() / 변수명.T : 행과 열의 위치 변경
- 변수명.set_index(열 인덱스,inplace=False) : 특정 열을 행으로 지정
- 변수명.reindex(새로운 인덱스,fill_value) : 새로운 행 생성 단, 값이 없으면 nan으로 값이 나옴 fill_value=값을 통해 nan이 아닌 값을 넣고 생성 가능
- 변수명.reset_index() : 행 인덱스를 정수형 인덱스로 초기화, ()에 drop=True 넣으면 기존 행 컬럼으로 추가 X
- 변수명.sort_index() : 정렬. 기본값 오름차순 () 안에 ascending=False 하면 내림차순

In [21]:
import pandas as pd

In [22]:
file_name='data.csv'

In [23]:
DF=pd.read_csv(file_name)
DF

   no     name  age gender
0   1     Hong   10      F
1   2     Atom   25      F
2   3     Jang   63      M
3   4  IronMan   48      F
4   5     CapA  123      M
5   6       Po   45      F
6   7      San   25      M

In [24]:
DF.T

           0     1     2        3     4   5    6
no         1     2     3        4     5   6    7
name    Hong  Atom  Jang  IronMan  CapA  Po  San
age       10    25    63       48   123  45   25
gender     F     F     M        F     M   F    M

In [25]:
jumsu={'name':['마징가','태권V','원더우먼'],
       'kor':[89,98,99],
       'eng':[89,78,68],
       'math':[99,98,97]
       }

In [26]:
jumsuDF=pd.DataFrame(jumsu)
jumsuDF

   name  kor  eng  math
0   마징가   89   89    99
1   태권V   98   78    98
2  원더우먼   99   68    97

In [27]:
jumsuDF2=jumsuDF.set_index('name')
jumsuDF2

      kor  eng  math
name
마징가    89   89    99
태권V    98   78    98
원더우먼   99   68    97

In [28]:
jumsuDF2.loc[['마징가','원더우먼'],'eng']

name
마징가     89
원더우먼    68
Name: eng, dtype: int64

In [29]:
jumsuDF2=jumsuDF.set_index('eng')
jumsuDF2

     name  kor  math
eng
89    마징가   89    99
78    태권V   98    98
68   원더우먼   99    97

In [30]:
jumsuDF

   name  kor  eng  math
0   마징가   89   89    99
1   태권V   98   78    98
2  원더우먼   99   68    97

In [31]:
new_index=[0,1,'r0','r2',2]
jumsuDF2=jumsuDF.reindex(new_index,fill_value=0)
jumsuDF2

    name  kor  eng  math
0    마징가   89   89    99
1    태권V   98   78    98
r0     0    0    0     0
r2     0    0    0     0
2   원더우먼   99   68    97

In [32]:
jumsuDF

   name  kor  eng  math
0   마징가   89   89    99
1   태권V   98   78    98
2  원더우먼   99   68    97

In [33]:
DF2=jumsuDF.reset_index(drop=True)
DF2

   name  kor  eng  math
0   마징가   89   89    99
1   태권V   98   78    98
2  원더우먼   99   68    97

In [34]:
DF3=DF2['kor']

In [37]:
DF4=DF3.sort_index(ascending=False)
DF4

2    99
1    98
0    89
Name: kor, dtype: int64

In [39]:
data={'A':[98,78,156,99],
      'B':[78,56,85,45]}
DF1=pd.DataFrame(data)
DF2=DF1/4

In [41]:
print(DF1,DF2,sep='\n\n')

     A   B
0   98  78
1   78  56
2  156  85
3   99  45

       A      B
0  24.50  19.50
1  19.50  14.00
2  39.00  21.25
3  24.75  11.25

In [42]:
DF1 - DF2

        A      B
0   73.50  58.50
1   58.50  42.00
2  117.00  63.75
3   74.25  33.75

In [43]:
SR1=DF1['A']
SR1

0     98
1     78
2    156
3     99
Name: A, dtype: int64

In [44]:
DF2+SR1

    A   B   0   1   2   3
0 NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN

In [49]:
SRDF=SR1.to_frame()
DF1.T

    0   1    2   3
A  98  78  156  99
B  78  56   85  45

In [50]:
DF1.T+SR1

     0    1    2    3
A  196  156  312  198
B  176  134  241  144

In [51]:
SRDF

     A
0   98
1   78
2  156
3   99